OpenFOAM/OpenFOAM-5.x/tutorials/multiphase/interMixingFoam/laminar/damBreak/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 0
    volScalarFieldValue alpha.other 1
    volScalarFieldValue alpha.water 0
);

regions
(
    boxToCell
    {
        box (0 0 -1) (0.1461 0.292 1);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0
            volScalarFieldValue alpha.water 1
        );
    }
    boxToCell
    {
        box (0.1461 0.05 -1) (1 1 1);
        fieldValues
        (
            volScalarFieldValue alpha.air 1
            volScalarFieldValue alpha.other 0
            volScalarFieldValue alpha.water 0
        );
    }
);


// ************************************************************************* //
